Delete & Insert

In [3]:
import pandas as pd

In [5]:
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[4,5,6,7,8]})

In [7]:
var

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [9]:
var.insert(1,"Insert1",var["A"])

In [11]:
var

   A  Insert1  B
0  1        1  4
1  2        2  5
2  3        3  6
3  4        4  7
4  5        5  8

In [15]:
var.insert(2,"Insert2", [86,5,43,3,2])

In [17]:
var

   A  Insert1  Insert2  B
0  1        1       86  4
1  2        2        5  5
2  3        3       43  6
3  4        4        3  7
4  5        5        2  8

In [25]:
var["Copy1"] = var["B"][:3]
var

   A  Insert1  Insert2  B  Copy1
0  1        1       86  4    4.0
1  2        2        5  5    5.0
2  3        3       43  6    6.0
3  4        4        3  7    NaN
4  5        5        2  8    NaN

Delete

In [28]:
var

   A  Insert1  Insert2  B  Copy1
0  1        1       86  4    4.0
1  2        2        5  5    5.0
2  3        3       43  6    6.0
3  4        4        3  7    NaN
4  5        5        2  8    NaN

In [30]:
var.pop("Insert1")

0    1
1    2
2    3
3    4
4    5
Name: Insert1, dtype: int64

In [32]:
var

   A  Insert2  B  Copy1
0  1       86  4    4.0
1  2        5  5    5.0
2  3       43  6    6.0
3  4        3  7    NaN
4  5        2  8    NaN

In [34]:
del var["Insert2"]

In [36]:
var

   A  B  Copy1
0  1  4    4.0
1  2  5    5.0
2  3  6    6.0
3  4  7    NaN
4  5  8    NaN